In [109]:
# from env import user, password, host < -- acquire is doing this.
import acquire as acq
import numpy as np
import pandas as pd
import prepare as prep
import seaborn as sns
from pydataset import data
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer

### Data Acquisition

Use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

- print the first 3 rows
- print the number of rows and columns (shape)
- print the column names
- print the data type of each column
- print the summary statistics for each of the numeric variables

In [110]:
df_iris = data('iris')

In [111]:
# You can pull the seaborn version, and it apparently looks nicer??
# But they look the same in VSCode at least if I run this line vs the one above.
df_iris = sns.load_dataset('iris')

In [112]:
df_iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [113]:
df_iris.shape

(150, 5)

In [114]:
df_iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [115]:
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [116]:
# df_iris.describe()
# Can transpose for a nicer view
df_iris.describe().T

              count      mean       std  min  25%   50%  75%  max
sepal_length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
sepal_width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
petal_length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
petal_width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5


Read the data from this google sheet into a dataframe, df_google.

- print the first 3 rows
- print the number of rows and columns
- print the column names
- print the data type of each column
- print the summary statistics for each of the numeric variables
- print the unique values for each of your categorical variables

In [117]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)

In [118]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [119]:
df_google.shape

(891, 12)

In [120]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [121]:
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [122]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [123]:
# These are all the objects, but they aren't all categorical.
# df_google.Name.unique(),df_google.Sex.unique(), df_google.Ticket.unique(), df_google.Cabin.unique(), df_google.Embarked.unique()
# For name, they should mostly have a unique name, for Ticket it appears to be their ticket number which should be unique as well, there is over 100 cabin categories but they could be used to identify where in the train they mostlikely were.
df_google.Sex.unique(), df_google.Cabin.unique(), df_google.Embarked.unique()

(array(['male', 'female'], dtype=object),
 array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
        'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
        'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
        'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
        'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
        'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
        'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
        'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
        'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
        'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
        'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
        'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
        'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
        'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
        'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
        'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
        'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
        'C148'], dtype=object),
 array(['S', 'C', 'Q', nan], dtype=object))

In [124]:
# He made an interesting count for his column uniques, I think I copied something wrong, because instead of numbers it's listing the world. Ah, biggest issue seems to be instead of {col} I had {df_google[col]} so it was pulling up too much.
for col in df_google.columns:
   if df_google[col].dtypes == 'object':
       print(f'{col} has {df_google[col].nunique()} unique values.')

Name has 891 unique values.
Sex has 2 unique values.
Ticket has 681 unique values.
Cabin has 147 unique values.
Embarked has 3 unique values.


Download the previous exercise's file into an excel (File → Download → Microsoft Excel). Read the downloaded file into a dataframe named df_excel.

- assign the first 100 rows to a new dataframe, df_excel_sample
- print the number of rows of your original dataframe
- print the first 5 column names
- print the column names that have a data type of object
- compute the range for each of the numeric variables.

In [125]:
df_excel = pd.read_excel('train.xlsx')

In [126]:
df_excel.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.25,NaN,S

In [127]:
df_excel_sample = df_excel.head(100)

In [128]:
len(df_excel)

891

In [129]:
df_excel.columns[0:5]

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex'], dtype='object')

In [130]:
list(df_excel.select_dtypes(['object']).columns)

['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [131]:
value_range = [df_excel.select_dtypes(['float']).max() - df_excel.select_dtypes(['float']).min()]
value_range

[PassengerId    890.0000
 Survived         1.0000
 Pclass           2.0000
 Age             79.5800
 SibSp            8.0000
 Parch            6.0000
 Fare           512.3292
 dtype: float64]

Make a new python module, acquire.py to hold the following data aquisition functions:

- Make a function named get_titanic_data that returns the titanic data from the codeup data science database as a pandas data frame. Obtain your data from the Codeup Data Science Database.

- Make a function named get_iris_data that returns the data from the iris_db on the codeup data science database as a pandas data frame. The returned data frame should include the actual name of the species in addition to the species_ids. Obtain your data from the Codeup Data Science Database.

- Make a function named get_telco_data that returns the data from the telco_churn database in SQL. In your SQL, be sure to join all 4 tables together, so that the resulting dataframe contains all the contract, payment, and internet service options. Obtain your data from the Codeup Data Science Database.

- Once you've got your get_titanic_data, get_iris_data, and get_telco_data functions written, now it's time to add caching to them. To do this, edit the beginning of the function to check for the local filename of telco.csv, titanic.csv, or iris.csv. If they exist, use the .csv file. If the file doesn't exist, then produce the SQL and pandas necessary to create a dataframe, then write the dataframe to a .csv file with the appropriate name.

### Data Preparation

Using the Iris Data:

- Use the function defined in acquire.py to load the iris data.

- Drop the species_id and measurement_id columns.

- Rename the species_name column to just species.

- Create dummy variables of the species name and concatenate onto the iris dataframe. (This is for practice, we don't always have to encode the target, but if we used species as a feature, we would need to encode it).

- Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [132]:
iris_df = acq.get_iris_data()

In [133]:
# iris_df = iris_df.drop(columns=['species_id', 'measurement_id', 'Unnamed: 0']).rename(columns={'species_name' : 'species'})
# Can do both at once.

In [134]:
iris_df.head()

,Unnamed: 0,species_id,species_name,measurement_id,sepal_length,sepal_width,petal_length,petal_width
0,0,1,setosa,1,5.1,3.5,1.4,0.2
1,1,1,setosa,2,4.9,3.0,1.4,0.2
2,2,1,setosa,3,4.7,3.2,1.3,0.2
3,3,1,setosa,4,4.6,3.1,1.5,0.2
4,4,1,setosa,5,5.0,3.6,1.4,0.2

In [135]:
iris_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      150 non-null    int64
 1   species_id      150 non-null    int64
 2   species_name    150 non-null    object
 3   measurement_id  150 non-null    int64
 4   sepal_length    150 non-null    float64
 5   sepal_width     150 non-null    float64
 6   petal_length    150 non-null    float64
 7   petal_width     150 non-null    float64
dtypes: float64(4), int64(3), object(1)
memory usage: 9.5+ KB

In [136]:
iris_df = iris_df.drop(columns=['species_id', 'measurement_id', 'Unnamed: 0'])

In [137]:
iris_df.head()

  species_name  sepal_length  sepal_width  petal_length  petal_width
0       setosa           5.1          3.5           1.4          0.2
1       setosa           4.9          3.0           1.4          0.2
2       setosa           4.7          3.2           1.3          0.2
3       setosa           4.6          3.1           1.5          0.2
4       setosa           5.0          3.6           1.4          0.2

In [138]:
iris_df = iris_df.rename(columns={'species_name' : 'species'})

In [139]:
iris_df.head()

  species  sepal_length  sepal_width  petal_length  petal_width
0  setosa           5.1          3.5           1.4          0.2
1  setosa           4.9          3.0           1.4          0.2
2  setosa           4.7          3.2           1.3          0.2
3  setosa           4.6          3.1           1.5          0.2
4  setosa           5.0          3.6           1.4          0.2

In [140]:
dummy_df = pd.get_dummies(iris_df.species, drop_first=True)

In [141]:
iris_df = pd.concat([iris_df,dummy_df], axis=1)

In [142]:
iris_df.head()

,species,sepal_length,sepal_width,petal_length,petal_width,versicolor,virginica
0,setosa,5.1,3.5,1.4,0.2,0,0
1,setosa,4.9,3.0,1.4,0.2,0,0
2,setosa,4.7,3.2,1.3,0.2,0,0
3,setosa,4.6,3.1,1.5,0.2,0,0
4,setosa,5.0,3.6,1.4,0.2,0,0

In [143]:
def prep_iris_data(df):
    '''
    For the Iris DB:
    Drops the Foreign Key Columns, renames 'species_name' to species, 
    then breaks the species into two dummy columns with int values.
    '''
    df = df.drop(columns=['species_id', 'measurement_id', 'Unnamed: 0']).rename(columns={'species_name' : 'species'})
    dummy_df = pd.get_dummies(df.species, drop_first=True)
    df = pd.concat([df,dummy_df], axis=1)
    return df

In [144]:
# iris_df = prep.prep_iris_data(iris_df)

In [145]:
iris_df.head()

,species,sepal_length,sepal_width,petal_length,petal_width,versicolor,virginica
0,setosa,5.1,3.5,1.4,0.2,0,0
1,setosa,4.9,3.0,1.4,0.2,0,0
2,setosa,4.7,3.2,1.3,0.2,0,0
3,setosa,4.6,3.1,1.5,0.2,0,0
4,setosa,5.0,3.6,1.4,0.2,0,0

Using the Titanic dataset:

- Use the function defined in acquire.py to load the Titanic data.

- Drop any unnecessary, unhelpful, or duplicated columns.

- Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

- Create a function named prep_titanic that accepts the raw titanic data, and returns the data with the transformations above applied.

In [146]:
titanic_df = acq.get_titanic_data()

In [147]:
titanic_df = titanic_df.drop_duplicates().drop(columns=['passenger_id', 'Unnamed: 0', 'age', 'class', 'embarked']).rename(columns={'pclass' : 'cabin_class', 'embark_town' : 'embarked'}) # I want to drop fare, but I'm not sure what the data is being used for, so Fare might be needed, if it's not about surviving.
titanic_df['family'] = titanic_df.sibsp + titanic_df.parch
titanic_df = titanic_df.drop(columns=["parch", "sibsp"])
titanic_df.deck.fillna("None", inplace=True)
titanic_df.embarked.fillna("", inplace=True)
titanic_df.index.names=["passenger_id"] # I doublechecked, passenger_id does share the same values as the index.

In [148]:
dummy_df = pd.get_dummies(["titanic_df.passenger_class", 'titanic_df.sex', 'titanic_df.embarked'], drop_first=True)

In [149]:
dummy_df.T

                            0  1  2
titanic_df.passenger_class  1  0  0
titanic_df.sex              0  1  0

In [150]:
titanic_df.head()

,survived,cabin_class,sex,fare,deck,embarked,alone,family
passenger_id,,,,,,,,
0,0,3,male,7.2500,None,Southampton,0,1
1,1,1,female,71.2833,C,Cherbourg,0,1
2,1,3,female,7.9250,None,Southampton,1,0
3,1,1,female,53.1000,C,Southampton,0,1
4,0,3,male,8.0500,None,Southampton,1,0

In [151]:
titanic_df.describe()

         survived  cabin_class        fare       alone      family
count  891.000000   891.000000  891.000000  891.000000  891.000000
mean     0.383838     2.308642   32.204208    0.602694    0.904602
std      0.486592     0.836071   49.693429    0.489615    1.613459
min      0.000000     1.000000    0.000000    0.000000    0.000000
25%      0.000000     2.000000    7.910400    0.000000    0.000000
50%      0.000000     3.000000   14.454200    1.000000    0.000000
75%      1.000000     3.000000   31.000000    1.000000    1.000000
max      1.000000     3.000000  512.329200    1.000000   10.000000

Using the Telco dataset:

- Use the function defined in acquire.py to load the Telco data.

- Drop any unnecessary, unhelpful, or duplicated columns. This could mean dropping foreign key columns but keeping the corresponding string values, for example.

- Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

- Create a function named prep_telco that accepts the raw telco data, and returns the data with the transformations above applied.

In [152]:
telco = acq.get_telco_data()

In [153]:
telco.head().T

,0,1,2,3,4
Unnamed: 0,0,1,2,3,4
customer_id,0002-ORFBO,0003-MKNFE,0004-TLHLJ,0011-IGKFF,0013-EXCHZ
internet_service_type_id,1,1,2,2,2
payment_type_id,2,2,1,1,2
contract_type_id,2,1,1,1,1
gender,Female,Male,Male,Male,Female
senior_citizen,0,0,0,1,1
partner,Yes,No,No,Yes,Yes
dependents,Yes,No,No,No,No
tenure,9,9,4,13,3
phone_service,Yes,Yes,Yes,Yes,Yes
multiple_lines,No,Yes,No,No,No
online_security,No,No,No,No,No
online_backup,Yes,No,No,Yes,No
device_protection,No,No,Yes,Yes,No
tech_support,Yes,No,No,No,Yes
streaming_tv,Yes,No,No,Yes,Yes
streaming_movies,No,Yes,No,Yes,No
paperless_billing,Yes,No,Yes,Yes,Yes
monthly_charges,65.6,59.9,73.9,98.0,83.9
total_charges,593.3,542.4,280.85,1237.85,267.4
churn,No,No,Yes,Yes,Yes
contract_type,One year,Month-to-month,Month-to-month,Month-to-month,Month-to-month
payment_type,Mailed check,Mailed check,Electronic check,Electronic check,Mailed check
internet_service_type,DSL,DSL,Fiber optic,Fiber optic,Fiber optic
churn_month,NaN,NaN,2022-01-31,2022-01-31,2022-01-31

In [154]:
telco = telco.drop_duplicates().drop(columns=['internet_service_type_id', 'contract_type_id', 'payment_type_id'])
telco.head()

,Unnamed: 0,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,...,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,payment_type,internet_service_type,churn_month
0,0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,No,...,Yes,No,Yes,65.6,593.3,No,One year,Mailed check,DSL,NaN
1,1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,No,...,No,Yes,No,59.9,542.4,No,Month-to-month,Mailed check,DSL,NaN
2,2,0004-TLHLJ,Male,0,No,No,4,Yes,No,No,...,No,No,Yes,73.9,280.85,Yes,Month-to-month,Electronic check,Fiber optic,2022-01-31
3,3,0011-IGKFF,Male,1,Yes,No,13,Yes,No,No,...,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Electronic check,Fiber optic,2022-01-31
4,4,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,No,...,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Mailed check,Fiber optic,2022-01-31

In [155]:
telco['gender_map'] = telco.gender.map({'Female' : 1, 'Male' : 0})
telco['partner_map'] = telco.partner.map({'Yes' : 1, 'No' : 0})
telco['dependents_map'] = telco.dependents.map({'Yes' : 1, 'No' : 0})
telco['phone_service_map'] = telco.phone_service.map({'Yes' : 1, 'No' : 0})
telco['paperless_billing_map'] = telco.paperless_billing.map({'Yes' : 1, 'No' : 0})
telco['churn_map'] = telco.churn.map({'Yes' : 1, 'No' : 0})
telco.head()

,Unnamed: 0,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,...,contract_type,payment_type,internet_service_type,churn_month,gender_map,partner_map,dependents_map,phone_service_map,paperless_billing_map,churn_map
0,0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,No,...,One year,Mailed check,DSL,NaN,1,1,1,1,1,0
1,1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,No,...,Month-to-month,Mailed check,DSL,NaN,0,0,0,1,0,0
2,2,0004-TLHLJ,Male,0,No,No,4,Yes,No,No,...,Month-to-month,Electronic check,Fiber optic,2022-01-31,0,0,0,1,1,1
3,3,0011-IGKFF,Male,1,Yes,No,13,Yes,No,No,...,Month-to-month,Electronic check,Fiber optic,2022-01-31,0,1,0,1,1,1
4,4,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,No,...,Month-to-month,Mailed check,Fiber optic,2022-01-31,1,1,0,1,1,1

In [156]:
dummy_df = pd.get_dummies(telco[['multiple_lines', 'online_security', 'online_backup', 'streaming_tv', 'streaming_movies', 'device_protection', 'tech_support', 'contract_type', 'internet_service_type', 'payment_type']], drop_first=True)
dummy_df

,multiple_lines_No phone service,multiple_lines_Yes,online_security_No internet service,online_security_Yes,online_backup_No internet service,online_backup_Yes,streaming_tv_No internet service,streaming_tv_Yes,streaming_movies_No internet service,streaming_movies_Yes,...,device_protection_Yes,tech_support_No internet service,tech_support_Yes,contract_type_One year,contract_type_Two year,internet_service_type_Fiber optic,internet_service_type_None,payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
0,0,0,0,0,0,1,0,1,0,0,...,0,0,1,1,0,0,0,0,0,1
1,0,1,0,0,0,0,0,0,0,1,...,0,0,0,0,0,0,0,0,0,1
2,0,0,0,0,0,0,0,0,0,0,...,1,0,0,0,0,1,0,0,1,0
3,0,0,0,0,0,1,0,1,0,1,...,1,0,0,0,0,1,0,0,1,0
4,0,0,0,0,0,0,0,1,0,0,...,0,0,1,0,0,1,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,0,0,0,1,0,0,0,0,0,0,...,0,0,1,1,0,0,0,0,0,1
7039,0,1,0,0,0,0,0,0,0,1,...,0,0,0,0,0,1,0,0,1,0
7040,0,0,0,0,0,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
7041,0,0,0,1,0,0,0,0,0,1,...,1,0,1,0,1,0,0,0,0,1
7042,1,0,0,1,0,1,0,1,0,1,...,1,0,0,0,1,0,0,0,1,0

In [157]:
telco = pd.concat([telco, dummy_df], axis=1)
telco.head()

,Unnamed: 0,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,...,device_protection_Yes,tech_support_No internet service,tech_support_Yes,contract_type_One year,contract_type_Two year,internet_service_type_Fiber optic,internet_service_type_None,payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
0,0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,No,...,0,0,1,1,0,0,0,0,0,1
1,1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,No,...,0,0,0,0,0,0,0,0,0,1
2,2,0004-TLHLJ,Male,0,No,No,4,Yes,No,No,...,1,0,0,0,0,1,0,0,1,0
3,3,0011-IGKFF,Male,1,Yes,No,13,Yes,No,No,...,1,0,0,0,0,1,0,0,1,0
4,4,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,No,...,0,0,1,0,0,1,0,0,0,1

Split your data:

- Write a function to split your data into train, test and validate datasets. Add this function to prepare.py.
- Run the function in your notebook on the Iris dataset, returning 3 datasets, train_iris, validate_iris and test_iris.
- Run the function on the Titanic dataset, returning 3 datasets, train_titanic, validate_titanic and test_titanic.
- Run the function on the Telco dataset, returning 3 datasets, train_telco, validate_telco and test_telco.

In [158]:
def data_split(df, target):
    '''
    take in a DataFrame and target.
    return train, validate, test DataFrames.
    '''
    train, test = train_test_split(df, test_size=.2, random_state=123, stratify=df[target])
    train, validate = train_test_split(train, test_size=.25, random_state=123, stratify=train[target])
    
    return train, validate, test

Iris Dataset:

In [159]:
train_iris, validate_iris, test_iris = prep.data_split(iris_df, 'species')

In [160]:
train_iris.head()

,species,sepal_length,sepal_width,petal_length,petal_width,versicolor,virginica
70,versicolor,5.9,3.2,4.8,1.8,1,0
123,virginica,6.3,2.7,4.9,1.8,0,1
87,versicolor,6.3,2.3,4.4,1.3,1,0
3,setosa,4.6,3.1,1.5,0.2,0,0
15,setosa,5.7,4.4,1.5,0.4,0,0

In [161]:
train_iris.shape, validate_iris.shape, test_iris.shape

((90, 7), (30, 7), (30, 7))

Titanic Dataset:

In [162]:
train_titanic, validate_titanic, test_titanic = prep.data_split(titanic_df, 'survived')

In [163]:
train_titanic.head()

,survived,cabin_class,sex,fare,deck,embarked,alone,family
passenger_id,,,,,,,,
455,1,3,male,7.8958,None,Cherbourg,1,0
380,1,1,female,227.5250,None,Cherbourg,1,0
492,0,1,male,30.5000,C,Southampton,1,0
55,1,1,male,35.5000,C,Southampton,1,0
243,0,3,male,7.1250,None,Southampton,1,0

In [164]:
train_titanic.shape, validate_titanic.shape, test_titanic.shape

((534, 8), (178, 8), (179, 8))

In [192]:
titanic_df[titanic_df.family > 7]

,survived,cabin_class,sex,fare,deck,embarked,alone,family
passenger_id,,,,,,,,
159,0,3,male,69.55,None,Southampton,0,10
180,0,3,female,69.55,None,Southampton,0,10
201,0,3,male,69.55,None,Southampton,0,10
324,0,3,male,69.55,None,Southampton,0,10
792,0,3,female,69.55,None,Southampton,0,10
846,0,3,male,69.55,None,Southampton,0,10
863,0,3,female,69.55,None,Southampton,0,10

Telco Dataset:

In [165]:
train_telco, validate_telco, test_telco = prep.data_split(telco, 'churn')

In [166]:
train_telco.head()

,Unnamed: 0,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,...,device_protection_Yes,tech_support_No internet service,tech_support_Yes,contract_type_One year,contract_type_Two year,internet_service_type_Fiber optic,internet_service_type_None,payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
5911,5911,8319-QBEHW,Male,0,No,Yes,26,No,No phone service,No,...,0,0,0,1,0,0,0,0,0,0
2479,2479,3547-LQRIK,Female,0,Yes,No,47,Yes,Yes,No internet service,...,0,1,0,1,0,0,1,0,1,0
5889,5889,8280-MQRQN,Female,0,No,No,1,Yes,No,No,...,1,0,0,0,0,0,0,0,0,1
6087,6087,8626-PTQGE,Male,0,No,No,69,No,No phone service,Yes,...,0,0,1,0,1,0,0,0,0,0
785,785,1142-IHLOO,Female,0,No,No,51,Yes,No,No,...,0,0,0,1,0,1,0,1,0,0

In [167]:
train_telco.shape, validate_telco.shape, test_telco.shape

((4225, 50), (1409, 50), (1409, 50))

### Tidy Data

##### Attendance Data

- Read the data from the attendance table and calculate an attendance percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

You should end up with something like this:

In [168]:
# name
# Billy    0.5250
# Jane     0.6875
# John     0.9125
# Sally    0.7625
# Name: grade, dtype: float64

##### Coffee Levels

- Read the coffee_levels table.
- Transform the data so that each carafe is in it's own column.
- Is this the best shape for the data?

##### Cake Recipes

- Read the cake_recipes table. This data set contains cake tastiness scores for combinations of different recipes, oven rack positions, and oven temperatures.
- Tidy the data as necessary.
- Which recipe, on average, is the best? recipe b
- Which oven temperature, on average, produces the best results? 275
- Which combination of recipe, rack position, and temperature gives the best result? recipe b, bottom rack, 300 degrees

Bonus: explore the other tables in the tidy_data database and reshape them as necessary so that they are in a tidy format.

### Exploratory Data Analysis

#### Correlated: For Numerical Values
#### Related: For String values

ex: passenger class and survival have a relation (are related), not a correlation (not correlated).

#### Part 1

##### iris_db: Using iris data from our mySQL server and the methods used in the lesson above:

1. Acquire, prepare & split your data.

In [169]:
iris = acq.get_iris_data()

In [170]:
iris.head()

,Unnamed: 0,species_id,species_name,measurement_id,sepal_length,sepal_width,petal_length,petal_width
0,0,1,setosa,1,5.1,3.5,1.4,0.2
1,1,1,setosa,2,4.9,3.0,1.4,0.2
2,2,1,setosa,3,4.7,3.2,1.3,0.2
3,3,1,setosa,4,4.6,3.1,1.5,0.2
4,4,1,setosa,5,5.0,3.6,1.4,0.2

In [171]:
iris = prep.prep_iris_data(iris)
train_iris, validate_iris, test_iris = prep.data_split(iris, 'species')


2. Univariate Stats

    - For each measurement type (quantitative variable): create a histogram, boxplot, & compute descriptive statistics (using .describe()).

    - For each species (categorical variable): create a frequency table and a bar plot of those frequencies.

    - Document takeaways & any actions.


3. Bivariate Stats

    - Visualize each measurement type (y-axis) with the species variable (x-axis) using barplots, adding a horizontal line showing the overall mean of the metric (y-axis).

    - For each measurement type, compute the descriptive statistics for each species.

    - For virginica & versicolor: Compare the mean petal_width using the Mann-Whitney test (scipy.stats.mannwhitneyu) to see if there is a significant difference between the two groups. Do the same for the other measurement types.

    - Document takeaways & any actions.


4. Multivariate Stats

    - Visualize the interaction of each measurement type with the others using a pairplot (or scatter matrix or something similar) and add color to represent species.

    - Visualize two numeric variables by means of the species. Hint: sns.relplot with hue or col

    - Create a swarmplot using a melted dataframe of all your numeric variables. The x-axis should be the variable name, the y-axis the measure. Add another dimension using color to represent species. Document takeaways from this visualization.

    - Ask a specific question of the data, such as: is the sepal area signficantly different in virginica compared to setosa? Answer the question through both a plot and using a mann-whitney or t-test. If you use a t-test, be sure assumptions are met (independence, normality, equal variance).

    - Document takeaways and any actions.

#### Part II
##### Explore your titanic dataset more completely.

- Determine drivers of the target variable

- Determine if certain columns should be dropped

- Determine if it would be valuable to bin some numeric columns

- Determine if it would be valuable to combine multiple columns into one.

Does it make sense to combine any features?

Do you find any surprises?

Document any and all findings and takeaways in your notebook using markdown.

In [174]:
titanic = acq.get_titanic_data()
titanic = prep.prep_titanic(titanic)
train_titanic, validate_titanic, test_titanic = prep.data_split(titanic, 'survived')

#### Part III
- Explore your telco data to discover drivers of churn

- Determine if certain columns should be dropped

- Determine if it would be valuable to bin some numeric columns

- Determine if it would be valuable to combine multiple columns into one.

What are your drivers of churn?

Does it make sense to combine any features?

Do you find any surprises?

Document any and all findings and takeaways in your notebook using markdown.

In [194]:
telco = acq.get_telco_data()
telco = prep.prep_telco(telco)
telco = telco.drop(columns=['Unnamed: 0']) # This guy keeps popping up, he can't be removed in the def it seems.
train_telco, validate_telco, test_telco = prep.data_split(telco, 'churn')
telco.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,streaming_tv_Yes,streaming_movies_No internet service,streaming_movies_Yes,contract_type_One year,contract_type_Two year,internet_service_type_Fiber optic,internet_service_type_None,payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,No,Yes,...,1,0,0,1,0,0,0,0,0,1
1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,No,No,...,0,0,1,0,0,0,0,0,0,1
2,0004-TLHLJ,Male,0,No,No,4,Yes,No,No,No,...,0,0,0,0,0,1,0,0,1,0
3,0011-IGKFF,Male,1,Yes,No,13,Yes,No,No,Yes,...,1,0,1,0,0,1,0,0,1,0
4,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,No,No,...,1,0,0,0,0,1,0,0,0,1

In [184]:
train_telco.shape, validate_telco.shape, test_telco.shape

((4225, 50), (1409, 50), (1409, 50))

In [185]:
# I'm actually curious if seniors are more or less likely to Churn.
# H0 : There's no difference between senior and non-senior Churn rate.
# Ha : There's noteable difference between senior and non-senior Churn rate.

In [214]:
# Univariate:
telco.gender.value_counts(), telco.senior_citizen.value_counts(), telco.partner.value_counts(), telco.partner[telco.senior_citizen == 1].value_counts(), telco.dependents.value_counts(), telco.dependents[telco.senior_citizen == 1].value_counts(), telco.tenure.mean(), telco.tenure[telco.tenure > 32].count(), telco.phone_service.value_counts(), telco.payment_type.value_counts(),

(Male      3555
 Female    3488
 Name: gender, dtype: int64,
 0    5901
 1    1142
 Name: senior_citizen, dtype: int64,
 No     3641
 Yes    3402
 Name: partner, dtype: int64,
 Yes    573
 No     569
 Name: partner, dtype: int64,
 No     4933
 Yes    2110
 Name: dependents, dtype: int64,
 No     1051
 Yes      91
 Name: dependents, dtype: int64,
 32.37114865824223,
 3268,
 Yes    6361
 No      682
 Name: phone_service, dtype: int64,
 Electronic check             2365
 Mailed check                 1612
 Bank transfer (automatic)    1544
 Credit card (automatic)      1522
 Name: payment_type, dtype: int64)

In [195]:
tel = train_telco # I just want a shorter var, and so I'll only look at the correct data set.
tel.head(10)

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,streaming_tv_Yes,streaming_movies_No internet service,streaming_movies_Yes,contract_type_One year,contract_type_Two year,internet_service_type_Fiber optic,internet_service_type_None,payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
5911,8319-QBEHW,Male,0,No,Yes,26,No,No phone service,No,Yes,...,1,0,0,1,0,0,0,0,0,0
2479,3547-LQRIK,Female,0,Yes,No,47,Yes,Yes,No internet service,No internet service,...,0,1,0,1,0,0,1,0,1,0
5889,8280-MQRQN,Female,0,No,No,1,Yes,No,No,No,...,0,0,0,0,0,0,0,0,0,1
6087,8626-PTQGE,Male,0,No,No,69,No,No phone service,Yes,Yes,...,1,0,1,0,1,0,0,0,0,0
785,1142-IHLOO,Female,0,No,No,51,Yes,No,No,No,...,1,0,1,1,0,1,0,1,0,0
3057,4374-YMUSQ,Male,0,No,No,34,Yes,Yes,Yes,Yes,...,1,0,1,1,0,1,0,1,0,0
5757,8098-LLAZX,Female,1,No,No,4,Yes,Yes,No,No,...,1,0,1,0,0,1,0,0,1,0
3465,4910-GMJOT,Female,0,No,No,1,Yes,Yes,No,No,...,1,0,1,0,0,1,0,0,1,0
1539,2250-IVBWA,Male,0,Yes,Yes,64,Yes,No,Yes,Yes,...,0,0,0,0,0,1,0,0,1,0
3175,4550-VBOFE,Male,1,Yes,No,70,Yes,Yes,No,Yes,...,1,0,1,0,0,1,0,0,1,0